finHome/Documents/ПоступленияДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ПоступленияДС</Name>
			<Comment>Поступления денежных средств</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ПоступенияДС</xr:Item>
				<xr:Item>AccumulationRegister.ДвиженияДС</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Поступления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЧленСемьи</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СоставСемьи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыДенежныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяДоходов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДоходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>9</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

finHome/AccumulationRegisters/ДвиженияДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ДвиженияДС</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЧленСемьи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СоставСемьи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

finHome/AccumulationRegisters/ПоступенияДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ПоступенияДС</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЧленСемьи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СоставСемьи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяДоходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

finHome/Documents/ПоступленияДС/Ext/ObjectModule.bsl
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ЭтотОбъект.Поступления.Количество() = 0 Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	СоздатьДвиженияПоРегиструДвиженийДС();
	СоздатьДвиженияПоРегиструПоступленийДС();
	
КонецПроцедуры   

Процедура СоздатьДвиженияПоРегиструДвиженийДС()
	
	УдалитьДвиженияПоРегиструДвиженийДС();
	НаборЗаписей = РегистрыНакопления.ДвиженияДС.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(ЭтотОбъект.Ссылка);
	НаборЗаписей.Прочитать();
	
	Для каждого Стр Из ЭтотОбъект.Поступления Цикл
		
		НСтр = НаборЗаписей.Добавить();    
		НСтр.Регистратор = ЭтотОбъект.Ссылка;
		НСтр.ВидДвижения = ВидДвиженияНакопления.Приход;
	    НСтр.Период = ЭтотОбъект.Дата;
		НСтр.ЧленСемьи = Стр.ЧленСемьи;
		НСтр.ВидДС = Стр.ВидДС;
		НСтр.Сумма = Стр.Сумма;
		
	КонецЦикла;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры 

Процедура СоздатьДвиженияПоРегиструПоступленийДС()

	УдалитьДвиженияПоРегиструПоступленийДС();
	НаборЗаписей = РегистрыНакопления.ПоступенияДС.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(ЭтотОбъект.Ссылка);
	НаборЗаписей.Прочитать();
	
	Для каждого Стр Из ЭтотОбъект.Поступления Цикл
		
		НСтр = НаборЗаписей.Добавить();    
		НСтр.Регистратор = ЭтотОбъект.Ссылка;
	    НСтр.Период = ЭтотОбъект.Дата;
		НСтр.ЧленСемьи = Стр.ЧленСемьи;
		НСтр.ВидДС = Стр.ВидДС; 
		НСтр.СтатьяДоходов = Стр.СтатьяДоходов;
		НСтр.Сумма = Стр.Сумма;
		
	КонецЦикла;
	
	НаборЗаписей.Записать();
	
	
КонецПроцедуры



Процедура ОбработкаУдаленияПроведения(Отказ)
	
	УдалитьДвиженияПоРегиструДвиженийДС(); 
	УдалитьДвиженияПоРегиструПоступленийДС();
	
КонецПроцедуры

Процедура УдалитьДвиженияПоРегиструДвиженийДС()
	
	НаборЗаписей = РегистрыНакопления.ДвиженияДС.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(ЭтотОбъект.Ссылка);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	НаборЗаписей.Записать();
	
КонецПроцедуры

Процедура УдалитьДвиженияПоРегиструПоступленийДС()
	
	НаборЗаписей = РегистрыНакопления.ПоступенияДС.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(ЭтотОбъект.Ссылка);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	НаборЗаписей.Записать();
	
КонецПроцедуры
